In [43]:
import pandas as pd

In [44]:
import numpy as np

In [45]:
df = pd.read_csv('../data/cafe_final.csv')

In [46]:
df.shape

(516, 5)

In [47]:
df.describe()

              valor  estacao_ano  valor_semestre  valor_bimestre
count  5.160000e+02   516.000000    8.600000e+01    2.580000e+02
mean   7.215016e+04     2.500000    4.329010e+05    1.443003e+05
std    3.688211e+05     1.119119    1.562326e+06    6.879693e+05
min    0.000000e+00     1.000000    0.000000e+00    0.000000e+00
25%    2.092925e+02     1.750000    1.204977e+03    4.271425e+02
50%    4.283950e+02     2.500000    2.594890e+03    8.614000e+02
75%    3.002007e+03     3.250000    2.061495e+04    5.969062e+03
max    4.056066e+06     4.000000    1.010121e+07    6.989920e+06

In [48]:
def index(data,y):
    ano = int(data.split('_')[0])
    mes = int(data.split('_')[1])
    i   = (ano - y)*12 + mes
    return i

In [49]:
index('2023_1',1981)

505

In [51]:
y = 1981
df['index']  = df['data'].apply(lambda x: index(x,y))

In [26]:
df.columns

Index(['data', 'valor', 'estacao_ano', 'valor_semestre', 'valor_bimestre',
       'index'],
      dtype='object')

In [52]:
df = df.sort_values(by='index')

In [56]:
df = df [['index','data','estacao_ano','valor','valor_bimestre','valor_semestre']]
df.head()

     index    data  estacao_ano    valor  valor_bimestre  valor_semestre
504      1  1981_1            1  6336.11             0.0             0.0
505      2  1981_2            1  6563.57             0.0             0.0
506      3  1981_3            1  6421.42             0.0             0.0
507      4  1981_4            2  6421.42             0.0             0.0
508      5  1981_5            2  6411.71             0.0             0.0

In [57]:
df['valor_bimestre'] = df['valor_bimestre'].fillna(0)
df['valor_semestre'] = df['valor_semestre'].fillna(0)

In [60]:
def soma_agrupada(lista, tam_grupo):
    nova_lista = []
    for i in range(len(lista)):
        soma = sum(lista[i:i+tam_grupo])
        if i%tam_grupo==0:
            nova_lista.append(soma)
    return nova_lista

In [79]:
i = 0
soma_bim = 0
s2 = []
for index, row in df.iterrows():
    soma_bim = soma_bim + row['valor']
    s2.append(soma_bim)
    i = i + 1
    if i > 1 :
        i = 0
        soma_bim = 0

In [89]:
i = 0
janela_bim = 0
j2 = []
valor_anterior = 0
for index, row in df.iterrows():
    janela_bim =  row['valor'] + valor_anterior
    valor_anterior = row['valor']
    j2.append(janela_bim)

j2

In [85]:
i = 0
soma_sem = 0
s6 = []
valor_anterior = 0
for index, row in df.iterrows():
    soma_sem = soma_sem + row['valor']
    s6.append(soma_sem)
    i = i + 1
    if i > 5 :
        i = 0
        soma_sem = 0

In [82]:
df['valor_bimestre'] = s2

In [86]:
df['valor_semestre'] = s6

In [91]:
df['janela_bimestre'] = j2

In [93]:
df.head(20)

,index,data,estacao_ano,valor,valor_bimestre,valor_semestre,janela_bimestre
504,1,1981_1,1,6336.11,6336.11,6336.11,6336.11
505,2,1981_2,1,6563.57,12899.68,12899.68,12899.68
506,3,1981_3,1,6421.42,6421.42,19321.10,12984.99
507,4,1981_4,2,6421.42,12842.84,25742.52,12842.84
508,5,1981_5,2,6411.71,6411.71,32154.23,12833.13
509,6,1981_6,2,6207.21,12618.92,38361.44,12618.92
510,7,1981_7,3,6533.26,6533.26,6533.26,12740.47
511,8,1981_8,3,7455.29,13988.55,13988.55,13988.55
512,9,1981_9,3,7601.47,7601.47,21590.02,15056.76
513,10,1981_10,4,7814.22,15415.69,29404.24,15415.69
514,11,1981_11,4,8670.28,8670.28,38074.52,16484.50
515,12,1981_12,4,10055.01,18725.29,48129.53,18725.29
492,13,1982_1,1,10751.46,10751.46,10751.46,20806.47
493,14,1982_2,1,11521.11,22272.57,22272.57,22272.57
494,15,1982_3,1,12409.68,12409.68,34682.25,23930.79
495,16,1982_4,2,13397.29,25806.97,48079.54,25806.97
496,17,1982_5,2,13922.95,13922.95,62002.49,27320.24
497,18,1982_6,2,16164.71,30087.66,78167.20,30087.66
498,19,1982_7,3,15423.39,15423.39,15423.39,31588.10
499,20,1982_8,3,16280.62,31704.01,31704.01,31704.01

In [94]:
df.head(10)

,index,data,estacao_ano,valor,valor_bimestre,valor_semestre,janela_bimestre
504,1,1981_1,1,6336.11,6336.11,6336.11,6336.11
505,2,1981_2,1,6563.57,12899.68,12899.68,12899.68
506,3,1981_3,1,6421.42,6421.42,19321.10,12984.99
507,4,1981_4,2,6421.42,12842.84,25742.52,12842.84
508,5,1981_5,2,6411.71,6411.71,32154.23,12833.13
509,6,1981_6,2,6207.21,12618.92,38361.44,12618.92
510,7,1981_7,3,6533.26,6533.26,6533.26,12740.47
511,8,1981_8,3,7455.29,13988.55,13988.55,13988.55
512,9,1981_9,3,7601.47,7601.47,21590.02,15056.76
513,10,1981_10,4,7814.22,15415.69,29404.24,15415.69

In [95]:
df.head(5)

,index,data,estacao_ano,valor,valor_bimestre,valor_semestre,janela_bimestre
504,1,1981_1,1,6336.11,6336.11,6336.11,6336.11
505,2,1981_2,1,6563.57,12899.68,12899.68,12899.68
506,3,1981_3,1,6421.42,6421.42,19321.10,12984.99
507,4,1981_4,2,6421.42,12842.84,25742.52,12842.84
508,5,1981_5,2,6411.71,6411.71,32154.23,12833.13

1 =  verão - 21 de dezembro a 21 de março 
2 = outono - 21 de março a 21 de junho
3 = inverno - 21 de junho a 23 de setembro
4 = primavera - 23 de setembro a 21 de dezembro

In [ ]:
df = pd.read_csv('../data/cafe_final.csv')

In [ ]:
df.head(5)

In [ ]:
df.tail(5)

In [ ]:
len(df)